{
  "start": "intro",

  "scenes": {
    "intro":{
        "text":"Вас прибило к берегу нежной песчаной волной. Морские брызги попадают на лицо, пробуждают и заставляют сесть, смотря на окружение.",
        "image":"images2/sandBeach.jpg",
        "choices":[
            {"text":"Осмотреть себя", "next":"selfLook"},
            {"text":"Осмотреть пляж", "next":"beachLook"}
        ]
    },
    
    "selfLook":{
      "text":"Кажется, вы выглядите как обычно. Разве что кожа слегка размокла и... В кармане вы находите голубоватую жемчужину. Интересно, что она там забыла?",
      "sets":["pearl"],
      "image":"images2/pearl.jpg",
      "next":"beach"
    },

    "beachLook":{
      "text":"Белый песок нежный и тёплый. Вода тихо плещется у ног и... К берегу прибивает голубоватую жемчужину, словно излучающую свет. Будет приятно забрать её с собой.",
      "sets":["pearl"],
      "image":"images2/pearl.jpg",
      "next":"beach"
    },

    "beach":{
      "text":"Вы поднимаете глаза. Спереди бесконечное море, сзади зеленеет летняя трава, а справа виднеются приземленные домики и... Причал с лодочками! Может, там помогут вернутся домой?",
      "image":"images2/sandBeach.jpg",
      "next":"village"
    },

    "village":{
      "text":"Вы направляетесь к деревне. Ноги едва перебираются и тут вы слышите, как сзади Вас кто-то окликивает.\n— あなたは誰ですか。",
      "image":"images2/village.jpg",
      "choices":[
        {
          "text":"Киньте d20",
          "dice":{
            "results":[
              {"from":1, "to":10, "next":"villagedFalse"},
              {"from":11, "to":20, "next":"villagedTrue"}
            ]
          }
        }
      ]
    },

    "villagedFalse":{
      "text":"Вы растерянно оглядываетесь, не понимая, что вам только что сказали. В плетёной треугольной шляпе стоит рыбак, испуганно поблескивая глазами в вашу сторону. Вы неуверенно машете рукой в сторону порта.",
      "next":"fisherman"
    },

    "villagedTrue":{
      "text":"Кажется, это был японский? И, кажется, рыбак, стоящий неподалёку за вашей спиной, спросил, кто вы. Напрягая мозг, вы вспоминаете «助けて», «помогите» и указываете в сторону порта. Из-под плетенной треугольной шляпы рыбака недоверчиво блеснули глаза.",
      "next":"fisherman"
    },

    "fisherman":{
      "text":"Кажется, японец не совсем понял, что с вами делать, потому ушёл вперёд, в нужном вам направлении. В какой-то момент обернулся, словно приглашая пойти за собой.\nПоследовать за ним?",
      "image":"images2/fisherman.jpg",
      "choices":[
        {"text":"Да", "next":"portTrue"},
        {"text":"Нет", "next":"portFalse"}
      ]
    },

    "portTrue":{
      "text":"Вы вдвоём заходите в портовую деревню, рыбак тут же исчезает в толпе, и Вы остаётесь одни. ",
      "next":"port1"
    },

    "portFalse":{
      "text":"Чуть подождав, рыбак жмёт плечами и растворяется вдали. Потоптавшись на месте, вы всё-таки продолжаете идти в том же направлении.",
      "next":"port1"
    },

    "port1":{
      "text":"В деревне все глаза направлены на вас. Вы —чужак, это видно сразу, потому ещё больше хочется домой. Надо найти лодку, но сперва перекусить и высохнуть...",
      "image":"images2/village.jpg",
      "next":"port2"
    },
    "port2":{
      "text":"Куда бы вы ни пошли и к кому бы ни обратились — все игнорируют и обходят по дуге. Уже ночь. Слегка отчаявшись, вы садитесь, опираясь спиной о деревянную стену и прикрываете глаза. ",
      "image":"images2/village.jpg",
      "next":"port3"
    },
    "port3":{
      "text":"Внезапно, над вами нависает тень. Посмотрев на неё, вы узнаёте того самого рыбака.\n— いえみつ。\nКажется, он назвал своё имя?",
      "image":"images2/fisherman.jpg",
      "choices":[
        {"text":"Исекира", "next":"bayFalse"},
        {"text":"Иемитсу", "next":"bayTrue"},
        {"text":"Итачиху", "next":"bayFalse"}
      ]
    },

    "bayTrue":{
      "text":"Рыбак кивает, когда вы озвучиваете его имя, прикладывает палец к губам и ведет вас куда-то. Ничего не остаётся, кроме как доверится ему.",
      "next":"bay"
    },
    "bayFalse":{
      "text":"Рыбак недовольно цокает, качает головой, что-то бубнит себе под нос. Может попробуете еще раз?",
      "next":"port3"
    },
    "bay":{
      "text":"Японец вывел вас на причал. Перед вами — небольшая лодочка, которая, видимо, предназначена для вас. Пока он подготавливал всё к отплытию, начало светать.",
      "image":"images2/bay.jpg",
      "next":"boat"
    },

    "boat":{
      "text":"Лодка готова, пора отправляться домой. Кивнув рыбаку на прощанье, вы садитесь в лодку и выходите в открытое море... ",
      "image":"images2/boat.jpg",
      "next":"sea"
    },

    "sea":{
      "text":"Виды впечатляли. Вдали, кажется, открывался вид на гору Фудзи-сан, солнце грело кожу. И тут... На вас начала подниматься огромная волна! ",
      "image":"images2/wave.jpg",
      "choices":[
        {
          "text":"Киньте d20",
          "dice":{
            "results":[
              {"from":1, "to":10, "next":"waveFalse"},
              {"from":11, "to":20, "next":"waveTrue"}
            ]
          }
        }
      ]
    },

    "waveFalse":{
      "text":"Волна стремительно настигала вас. Неужели сейчас она вас потопит?",
      "next":"pearl"
    },
    "waveTrue":{
      "text":"Каким-то чудом вам удаётся обплыть волну. Но вот незадача — на вас поднимается вторая, ещё крупнее!",
      "next":"pearl"
    },
    "pearl":{
      "text":"Найденная в самом начале жемчужина начинает светиться, так, что сложно смотреть на неё, обволакивает вас теплом. Столкновения с волной не происходит, и, открыв глаза, вы видите яркое солнечное море. В руках у вас что-то есть... Можете открыть подарок!",
      "image":"images2/present.jpg"
    }
  

  }
}