{
  "start": "intro",

  "scenes": {
    "intro":{
        "text":"Это место кажется вам отдалённо знакомым. Вокруг стеллажи, на них книги и другие интересные предметы.",
        "image":"images4/library1.jpg",
        "choices":[
            {"text":"Осмотреться", "next":"lib2"}
        ]
    },
    "lib2":{
        "text":"Проходя мимо полок, вы случайно задеваете одну из них. Откуда-то сверху доносится грохот и, кажется, что-то падает!",
        "image":"images4/library2.jpg",
        "choices":[
            {
                "text":"Киньте d20",
                "dice":{
                    "results":[
                        {"from":1, "to":10, "next":"lib2dice0"},
                        {"from":11, "to":20, "next":"lib2dice1"}
                    ]
                }
            }
        ]
    },
    "lib2dice0":{
        "text":"Прямо на голову вам прилетает какая-то книга. Не больно, но всё равно неприятно...",
        "next":"shelves"
    },
    "lib2dice1":{
        "text":"Вы едва уворачиваетесь от летящего на вас предмета. Рядом с тем местом, где была ваша голова — приземляется книга. Чуть не упала на вас...",
        "next":"shelves"
    },

    "shelves":{
        "text":"На полках страшный беспорядок: куча пустых коробок, ящиков, предметов явно не на своих местах. Но где-то в глубине лежит предмет, который вас привлекает и хочется его взять. Стоит ли прибраться?",
        "image":"images4/shelves.jpg",
        "choices":[
            {"text":"Да", "next":"shelYes"},
            {"text":"Нет", "next":"shelNo"}
        ]
    },
    "shelYes":{
        "text":"Завучив рукава, вы готовитесь добраться до желаемого!",
        "next":"vara"
    },
    "shelNo":{
        "text":"Вы все равно пытаетесь забрать предмет. Просовываете руку, пытаетесь дотянуться, и... Все вещи сваливаются прямо на вас! Похоже, все равно придется разбирать завал, только чтобы выбраться!",
        "next":"vara"
    },

    "vara":{
        "text":"Под рукой у вас оказывается листок и ручка. На нём нарисованы цифры, но все остальное — пустое. Кажется, надо будет что-то на нём написать...",
        "next":"alb"
    },

    "alb":{
        "text":"Сперва в коробку пошёл фотоальбом. В нём с картинок улыбалась вам ваша семья. Какая приятная неожиданность! Интересно, какое же ваше любимое воспоминание?..",
        "image":"images4/album.jpg",
        "next":"cloth"
    },

    "cloth":{
        "text":"Потом на полке обнаружилась одежда. Помятые платья, что вы когда-то носили... Какое из них вы надевали чаще всего?",
        "image":"images4/clothes.jpg",
        "next":"lett"
    },

    "lett":{
        "text":"Копаясь в вещах, вы находили старые грамоты, письма, медали. Которой вы гордились больше всего?",
        "image":"images4/letters.jpg",
        "next":"gift"
    },

    "gift":{
        "text":"Вы много где побывали и привезли их разных мест разные предметы, которые сейчас лежали в этой странной библиотеке. Куда вы бы хотели вернуться?",
        "image":"images4/gifts.jpg",
        "next":"pix"
    },

    "pix":{
        "text":"Наконец, вы добрались до того, что привлекло ваше внимание. И этим чем-то оказалась... фея! Она внимательно посмотрела на вас и протянула руки, будто ожидая, что вы что-то отдадите.",
        "image":"images4/pixie.jpg",
        "choices":[
            {"text":"Отдать заполненный листок", "next":"pixYes"},
            {"text":"Отдать пустой листок", "next":"pixNo"}
        ]
    },
    "pixYes":{
        "text":"Фея с благодарностью забирает листок.\n— Иногда, что-то прибирая, можно много вспомнить. В вещах хранятся воспоминания, и чтобы снова к ним притронуться... Иногда надо знать, где они находятся!",
        "next":"crown"
    },
    "pixNo":{
        "text":"Фея слегка грустно смотрит на листок бумаги.\n— Вещи хранят воспоминания. Иногда, находя их, мы можем погрузиться в, казалось бы, забытые мелочи. Возможно, их стоит правильно хранить?",
        "next":"crown"
    },

    "crown":{
        "text":"Фея с тихим хлопком исчезла, оставляя после себя маленькую тиару, больше похожую на обычное кольцо.",
        "image":"images4/tiara.jpg",
        "next":"finish"
    },

    "finish":{
        "text":"Кольцо, излучающее тепло, потихоньку начинает плавится, и под из него что-то появляется... Можете открыть подарок!",
        "image":"images4/final.jpg"
    }

  }
}