{
  "start": "intro",

  "scenes": {
    "intro":{
        "text":"Жестокий ветер дул прямо в лицо, царапая и поднимая волосы. Вы вскакиваете на месте, и тут же оседаете обратно. Вы на крыше многоэтажного здания!",
        "image":"images5/sky.jpg",
        "choices":[
            {"text":"Осмотреться", "next":"city1"}
        ]
    },

    "city1":{
        "text":"Здание не слишком высокое, всего девять этажей, но очнуться на его краю — несомненно неожиданно. Рядом виднелись крыши ещё нескольких домов, а так же запломбирования дверь, ведущая внутрь здания. Так просто её не открыть, а на других крышах дверей не виднеется...",
        "image":"images5/city1.jpg",
        "choices":[
            {"text":"Осмотреть дверь", "next":"city1.1"}
        ]
    },
    "city1.1":{
        "text":"Вы дергаете ручку, пытаетесь выломать силой, но ничего не получается. Здесь бы пригодился лом... Надо поискать его на соседних домах.",
        "image":"images5/door.jpg",
        "choices":[
            {"text":"Перейти на другую крышу", "next":"city1.2"}
        ]
    },
    "city1.2":{
        "text":"Похоже единственный вариант — поискать возможность выбраться на соседних крышах, но до них ещё стоит допрыгнуть....",
        "image":"images5/city1.jpg",
        "next":"city2"
    },

    "city2":{
        "text":"Вы пытаетесь перепрыгнуть на соседнее здание. Взяв разгон, вы совершаете прыжок веры! ",
        "choices":[
            {
                "text":"Киньте d20",
                "dice":{
                    "results":[
                        {"from":1, "to":10, "next":"jumpfall"},
                        {"from":11, "to":20, "next":"jumpyeah"}
                    ]
                }
            }
        ]
    },
    "jumpfall":{
        "text":"В последний момент пятка соскальзывает, вы летите вниз, и внезапно оказываетесь в начале своего пути.",
        "image":"images5/city2.jpg",
        "next":"intro"
    },
    "jumpyeah":{
        "text":"С небольшим трудом, но вы всё же допрыгнули без особых проблем. Что ж, было не так сложно, как могло показаться.",
        "image":"images5/city2.jpg",
        "next":"city2.1"
    },
    "city2.1":{
        "text":"Другая крыша не особо сильно отличалась от изначальной... Делать нечего, либо что-то искать, либо идти дальше.",
        "image":"images5/city2.jpg",
        "choices":[
            {"text":"Осмотреться", "next":"city2.2"}
        ]
    },
    "city2.2":{
        "text":"Вы оглядываете крышу и вдали видно что-то бесформенное. Пора подойти поближе!",
        "image":"images5/city2.jpg",
        "choices":[
            {"text":"Перейти на другую крышу", "next":"city2.3"}
        ]
    },
    "city2.3":{
        "text":"Во второй раз прыжок получается в разы проще. Вы стоите на новом здании, и видите какой-то предмет...",
        "image":"images5/city2.jpg",
        "next":"ant"
    },

    "ant":{
        "text":"То, что вы видите — это антена! Самая обычная, металлическая... Может, из неё получится сделать лом? Другие двери вряд ли быстро встретятся на пути.",
        "image":"images5/Antenna.jpg",
        "choices":[
            {
                "text":"Киньте d20",
                "dice":{
                    "results":[
                        {"from":1, "to":10, "next":"brAnt0"},
                        {"from":11, "to":20, "next":"brAnt1"}
                    ]
                }
            }
        ]
    },
    "brAnt0":{
        "text":"Антена сломалась, но повредила вашу руку, надо скорее выбираться и искать, чем можно перевязать рану!",
        "image":"images5/brokenAntenna.jpg",
        "sets":["start"],
        "next":"cityLast"
    },
    "brAnt1":{
        "text":"На удивление, металл легко согнулся и... Сразу принял форму лома! Удивительное везение.",
        "image":"images5/brokenAntenna.jpg",
        "sets":["ant"],
        "next":"cityLast"
    },

    "cityLast":{
        "text":"Лом теперь у вас, пора возвращаться к двери и пробовать открыть дверь. Всё должно получиться, уже пора выходить отсюда.",
        "image":"images5/city2.jpg",
        "choices":[
            {"text":"Лома нет", "requires":["start"], "next":"intro"},
            {"text":"Дальше", "requires":["ant"], "next":"jumpBack"}
        ]
    },
    "jumpBack":{
        "text":"Прыжки меж крышами позволили почувствовать некую свободу, лёгкость в движении. Паркурить оказалось на удивление приятно, пускай и пришлось набить пару синяков, но ничего же не сломали и на том спасибо.",
        "image":"images5/city1.jpg",
        "next":"door2"
    },
    "door2":{
        "text":"Дверь как и стояла, так и стоит. Кажется, настало время открыть её...",
        "image":"images5/door.jpg",
        "choices":[
            {"text":"Открыть дверь", "requires":["ant"], "next":"door3"}
        ]
    },
    "door3":{
        "text":"За дверью непроглядная темнота. Идти туда страшновато, крыши стали уже привычным окружением, может, не стоит туда идти, остаться в иллюзии комфорта?",
        "image":"images5/dark.jpg",
        "choices":[
            {"text":"Зайти внутрь", "next":"dark1"},
            {"text":"Остаться", "next":"dark2"}
        ]
    },
    "dark1":{
        "text":"Вдохнув, вы закрываете глаза и делаете шаг в неизведанное. Однако вместо падения вы... Ничего не чувствуете.",
        "image":"images5/dark.jpg",
        "next":"final"
    },
    "dark2":{
        "text":"Вы решаете остаться на месте. Интересно, долго ли вы здесь протянете, с ветром в волосах и жутким холодом?..",
        "image":"images5/dark.jpg",
        "next":"intro"
    },
    "final":{
        "text":"Паркур — это круто, но иногда стоит беречь себя и не боятся идти. Можно открыть подарок!",
        "image":"images5/present.jpg"
    }

  }
}