{
  "start": "intro",

  "scenes": {
    "intro":{
        "text":"Вокруг горят зеленые огни, а чёрные камни под ногами неприятно режут стопы. Впереди, за аркой из цепей, виднеется дверь.",
        "image":"images3/abyss.jpg",
        "choices":[
            {"text":"Осмотреться", "next":"findKey"},
            {"text":"Открыть дверь", "next":"door"}
        ]
    },

    "findKey":{
        "text":"Вы находите старый ржавый ключ с интересной гравировкой. Он висел на шее странной каменной статуи.",
        "image":"images3/key.jpg",
        "sets":["key"],
        "next":"door"
    },

    "door":{
        "text":"Дверь заперта. Но в неё надо как-то попасть — больше деваться некуда, разве что прыгать в пропасть со скалы.",
        "image":"images3/door.jpg",
        "choices":[
            {"text":"Использовать ключ", "requires":["key"], "next":"doorOpen"},
            {
                "text":"Попробовать выбить дверь (d20)", 
                "dice":{
                    "results":[
                        {"from":1, "to":10, "next":"doorFalse"},
                        {"from":11, "to":20, "next":"doorOpen"}
                    ]
                }
            }
        ]
    },
    "doorFalse":{
        "text":"Дверь выбить не получилось, похоже, придётся вернуться в начало и найти ключ...",
        "next":"intro"
    },
    "doorOpen":{
        "text":"Зайдя за дверь, вы видите большой зал и несколько каменных статуй. Вы понимаете, что эти статуи — люди! Вот только что с ними стало? ",
        "image":"images3/state.jpg",
        "next":"Ilidan"
    },
    "Ilidan":{
        "text":"Пройдя дальше по сужающемуся коридору, вы видите фигуру, прикованную цепями к стене. Подойдя поближе, вы понимаете, что это... Иллидан! Кажется, он спит...",
        "image":"images3/ilidan.jpg",
        "choices":[
            {"text":"Разбудить его", "next":"awake"},
            {"text":"Осмотреть его", "next":"iliLook"}
        ]
    },
    "awake":{
        "text":"Вы зовете его и он медленно открывает глаза. Мутный взгляд за мгновение становится острым, демон делает рывок вперед, цепи сдерживают его, и он обмякает, не в силах пошевелиться.",
        "next":"Eyes"
    },
    "iliLook":{
        "text":"Вы оглядываете Иллидана, кажется, он измотан, устал. Неизвестно, сколько он здесь висит. Подойдя поближе, вы чувствуете его взгляд.",
        "next":"Eyes"
    },

    "Eyes":{
        "text":"— Кто ты? \nИллидан анализирует ситуацию, осматривает вас и словно делает какие-то выводы.\n— Помоги мне. Пламенный легион в который раз собирается напасть, сейчас они ищут источники чистой магии, что я забрал, а я не смогу их защитить... Будучи здесь.",
        "image":"images3/eyes.jpg",
        "next":"Ring"
    },
    "Ring":{
        "text":"— Это кольцо, — Иллидан поднял палец, — Впитало мою силу. Ты должен искупать его в фиале света, и тогда я смогу вырваться отсюда.\nПомогать ли ему? Он прослыл и предателем, и преданным героем. В любом случае, если в кольце заключена его сила, то почему бы не взять его себе?",
        "image":"images3/ring.jpg",
        "choices":[
            {"text":"Взять кольцо", "next":"Ring2"}
        ]
    },
    "Ring2":{
        "text":"— Да, да, а теперь верни мне силу!",
        "image":"images3/ilidan.jpg",
        "choices":[
            {"text":"Осмотреться", "next":"Cave"}
        ]
    },

    "Cave":{
        "text":"В комнате, помимо стен, выгравированный в камне, есть небольшой омут. Тусклый свет исходит от наполняющей его воды. Стоит ли вернуть Иллидану силы?",
        "image":"images3/cave.jpg",
        "choices":[
            {"text":"Да", "next":"caveYes"},
            {"text":"Нет", "next":"caveNo"}
        ]
    },
    "caveYes":{
        "text":"Вы кидаете кольцо в воду. Оно шипит, растворяется, и остаётся лишь небольшой осколок кристалла.",
        "image":"images3/crystall.jpg",
        "next":"powerIlidan"
    },
    "caveNo":{
        "text":"Вы надеваете кольцо на себя. Разум мгновенно помутился, невероятная мощь потекла по венам и... Кажется, она вас разорвёт! Остается лишь подчиниться воле Иллидана и бросить его в фиале света. Совершив рывок, вы спасаете себя. Кольцо шипит, оставляя после себя лишь небольшой осколок кристалла.",
        "image":"images3/crystall.jpg",
        "next":"powerIlidan"
    },

    "powerIlidan":{
        "text":"— Ха-ха-ха, моя сила снова со мной! Я вовек не забуду твоей помощи, человек... Этот мир... Будет моим!\nИллидан рвёт цепи, скалится, и проходит мимо тебя. Кажется, всё же вы совершили ошибку. Его стоит остановить! ",
        "image":"images3/powerIlidan.jpg",
        "choices":[
            {
                "text":"Кинуть d20",
                "dice":{
                    "results":[
                        {"from":1, "to":10, "next":"iliDice0"},
                        {"from":11, "to":20, "next":"iliDice1"}
                    ]
                }
            }
        ]
    },
    "iliDice0":{
        "text":"Вы понимаете, что ваших сил не хватит, чтобы его остановить и вы рвётесь вперёд, вонзая ему меж лопаток единственное, что у вас было под рукой — кристалл. Пещинка откалывается от него и падает на пол...",
        "next":"Cave2"
    },
    "iliDice1":{
        "text":"Возможно, кристалл, что остался от кольца, поможет? Вы берете его в руки и бежите к недооценивающему вас Иллидану, вонзая ему меж лопаток единственное, что у вас было под рукой — кристалл. Пещинка откалывается от него и падает на пол...",
        "next":"Cave2"
    },

    "Cave2":{
        "text":"Обездвиженное тело Предателя падает на пол. Он не может шевелиться, говорить, его глаза постепенно закрываются. Иллидан погрузился в сон, теперь его не так легко будет освободить.",
        "image":"images3/cave.jpg",
        "next":"finish"
    },
    "finish":{
        "text":"Песчинка начинает излучать свет и формируется во что-то иное... Можете открыть подарок!",
        "image":"images3/present.jpg"
    }

  }
}