{
  "start": "intro",

  "scenes": {
    "intro": {
      "text": "Ледяная пещера сверкает от солнца, проходящего сквозь прозрачную толщу. ",
      "image":"images1/iceCave.avif",
      "choices":[
        {
          "text":"Бросьте d20, чтобы осмотреться",
          "dice":{
            "results":[
              {"from":1, "to":10, "next":"otherCave"},
              {"from":11, "to":20, "next":"successExitFromVillage"}
            ]
          }
        }
      ]
    }, 

    "otherCave":{
      "text":"Вокруг, кажется, нет ни души, ничего примечательного. Остаётся только бродить дальше, в надежде что-то отыскать.",
      "image":"images1/iceCave.avif",
      "next":"village"
    },

    "successExitFromVillage":{
      "text":"Кажется, по левую сторону от вас свет ярче и насыщенней. Может, там выход из пещеры? Выбора особо нет, как и вариантов, почему бы не пройти туда. Вы нашли сосульку.",
      "image":"images1/iceCave2.webp",
      "sets":["icicle"],
      "next":"village"
    },

    "village":{
      "text":"Вы выходите прямо к деревне. Утро, вокруг тихо и уютно, с разных сторон раздаётся потрескивание костра. Как же хочется согреться... Надеюсь вы взяли в ледянной пещере сосульку, если нет - начните с начала. В какую же сторону стоит пойти?",
      "image":"images1/snowVillage.jpg",
      "choices":[
        {"text":"Прямо (центр деревни)", "next":"villageCenter"},
        {"text":"Направо (жилой домик)", "next":"woodenHome"},
        {"text":"Налево (конюшни)", "next":"stable"}
      ]
    },

    "villageCenter":{
      "text":"Кажется, вы вышли к центру деревни. Нелюдно, но видны следы прошедшего  праздника: пустые бутылки из-под вина, праздничные ленты, потухшие угли.",
      "choices":[
        {"text":"Осмотреться? (нужна сосулька)", "requires":["icicle"], "next":"lookAroundIcicle"}
      ]
    },

    "lookAroundIcicle":{
      "text":"Под снегом, в лучах солнца, блестела маленькая серебряная коробочка. Наверное, пригодится...",
      "image":"images1/icicleMan.jpg",
      "sets":["present"],
      "next":"man"
    },

    "woodenHome":{
      "text":"Стоит аккуратный деревянный домик. Крышу припорошило снегом, из трубы поднимаются клубы тёплого дыма. Кажется, оттуда доносится детский смех.",
      "choices":[
        {"text":"Осмотреться? (нужна сосулька)", "requires":["icicle"], "next":"lookAroundIcicle"}
      ]
    },

    "stable":{
      "text":"В стойлах привязаны лошади, а за ними простирается бесконечная снежная тундра. Животные спокойно стоят, иногда переступая с ноги на ногу. Может, вам позволят взять одну?",
      "choices":[
        {"text":"Осмотреться? (нужна сосулька)", "requires":["icicle"], "next":"lookAroundIcicle"}
      ]
    },

    "man":{
      "text":"— Ты кто?\nПеред вами стоит человек, плотно закутанный в теплые одежды, направляет на вас копьё. Кажется, он охранник этой деревни. Однако, видя, как у вас стучат от холода зубы, сжаливается, присвистывает, и заводит в свою сторожку отогреться.",
      "image":"images1/man.jpg",
      "next":"mansHouse"
    },

    "mansHouse":{
      "text":"— Нездешний? Тут чужаков не особо жалуют, да и понятия не имею, как ты тут оказался. Что дальше будем делать?",
      "image":"images1/fireplace.jpg",
      "choices":[
        {"text":"Уйти домой", "next":"goHome"},
        {"text":"Остаться и осмотреть деревню", "next":"lookVillage"}
      ]
    },

    "goHome":{
      "text":"Охранник понимающе кивает, тихо отдаёт теплую одежду и, кажется, садиться в раздумьях.",
      "image":"images1/fireplace.jpg",
      "choices":[
        {
          "text":"Киньте d20",
          "dice":{
            "results":[
              {"from":1, "to":10, "next":"goHomeFalse"},
              {"from":11, "to":20, "next":"goHomeTrue"}
            ]
          }
        }
      ]
    },

    "goHomeFalse":{
      "text":"— В общем, дам я тебе свою восьмёрку. Едешь на запад, к ночи уже прибудешь к портовому городку, а там разберешься. Собак другу моему отдай, потом скажу, кому именно.",
      "next":"thundraNight"
    },

    "goHomeTrue":{
      "text":"— Лошадку деревенскую отдам, она тебя сама довезёт куда надо и сама же вернётся обратно. К портовому городу доедешь, а там видно будет...",
      "next":"thundraNight"
    },

    "lookVillage":{
      "text":"— Ну что ж, думаю, в честь праздника можно и приютить тебя ненадолго. Зимнее солнцестояние, в конце концов...",
      "image":"images1/fireplace.jpg",
      "next":"activeVillage"
    },

    "activeVillage":{
      "text":"Деревня постепенно начала оживать, люди выходить и праздновать. Вас, кажется, приняли с радушием, делились напитками и историями. А под вечер все направились в снежную пустошь.",
      "image":"images1/activeVillage.jpg",
      "next":"thundraNight"
    },

    "thundraNight":{
      "text":"Темнело. Вы почему-то замерли, в ожидании. Как будто сама вселенная остановилась и замерла вместе с вами. Вы подняли голову и...",
      "image":"images1/thundraNight.jpg",
      "next":"shining"
    },

    "shining":{
      "text":"Небо заискрилось зеленоватыми оттенками, закрывая звёзды. Сквозь тело пробежало всепоглощающающее спокойствие и ощущение, что всё будет хорошо.",
      "image":"images1/shining.jpeg",
      "next":"finish"
    },

    "finish":{
      "text":"Коробочка, что вы подобрали ранее, начинает теплеть и... Оттаивать! Можете забрать подарок!",
      "image":"images1/present.jpg"
    }

  }
}
